In [5]:
import pandas as pd

days = pd.Series(['Mon','Tue','Wed','Thu','Fri'])
days

0    Mon
1    Tue
2    Wed
3    Thu
4    Fri
dtype: object

In [6]:
sales = pd.DataFrame( {'Day' : ['Mon','Tue','Wed','Thu','Fri'], 'Sold': [45,55,60,70,65]})
sales

   Day  Sold
0  Mon    45
1  Tue    55
2  Wed    60
3  Thu    70
4  Fri    65

In [7]:
sales.columns

Index(['Day', 'Sold'], dtype='object')

In [8]:
sales.Sold

0    45
1    55
2    60
3    70
4    65
Name: Sold, dtype: int64

In [9]:
sales[0:2]

   Day  Sold
0  Mon    45
1  Tue    55

In [10]:
sales.Sold >= 60

0    False
1    False
2     True
3     True
4     True
Name: Sold, dtype: bool

In [11]:
sales[sales.Sold >= 60]

   Day  Sold
2  Wed    60
3  Thu    70
4  Fri    65

In [12]:
sales[sales.Sold >= 60].Day

2    Wed
3    Thu
4    Fri
Name: Day, dtype: object

In [13]:
total = sales.Sold.sum()
total

295

In [14]:
pot = sales.Sold / total
pot

0    0.152542
1    0.186441
2    0.203390
3    0.237288
4    0.220339
Name: Sold, dtype: float64

In [15]:
sales.insert(2,'PoT',pot)
sales

   Day  Sold       PoT
0  Mon    45  0.152542
1  Tue    55  0.186441
2  Wed    60  0.203390
3  Thu    70  0.237288
4  Fri    65  0.220339

In [16]:
sales[sales.PoT > 0.2][['Day' , 'PoT']]

   Day       PoT
2  Wed  0.203390
3  Thu  0.237288
4  Fri  0.220339

In [18]:
randomassinfo = pd.DataFrame( {"country": ["Brazil", "Russia", "India", "China", "South Africa"], "capital": ["Brasilia", "Moscow", "New Dehli", "Beijing", "Pretoria"], "area": [8.516, 17.10, 3.286, 9.597, 1.221], "population": [200.4, 143.5, 1252, 1357, 52.98] } )
randomassinfo

        country    capital    area  population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Dehli   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

In [20]:
randomassinfo = pd.DataFrame( {"country": ["Brazil", "Russia", "India", "China", "South Africa"], "capital": ["Brasilia", "Moscow", "New Dehli", "Beijing", "Pretoria"], "area": [8.516, 17.10, 3.286, 9.597, 1.221], "population": [200.4, 143.5, 1252, 1357, 52.98] } )
randomassinfo[country[0:2]]

NameError: name 'country' is not defined

In [29]:
import pandas as pd
exams = pd.DataFrame( {"name": ["Anastasia" , "Dima" , "Catherine"] , "score": [12.5 , 9.0 , 16.5] , "attempts": [1 , 3 , 2] , "qualify": ['yes' , 'no' , 'yes'] } )
exams

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Catherine   16.5         2     yes